uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
// test_stm32f4_dma - the reference bench suite for the STM32F4's two DMA
// controllers: the stream, its FIFO, its eight channels, the double
// buffer, the flow controller, the five flags and the two engines a byte
// transport plugs into - stm32f4/dma.hpp.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE. This chapter is the one that needs no pad at all,
// because a DMA controller's own memory-to-memory mode is an instrument:
// DMA2 moves a block of RAM into another block of RAM with no peripheral
// in the path, so every width, every burst, every FIFO threshold and
// every error can be measured against a byte-exact expectation and a
// cycle count. What memory-to-memory cannot show - circular mode, the
// double buffer, a stream paced by a peripheral's request - is measured
// on THE CONSOLE'S OWN TRANSMITTER, whose bit rate is the ruler and whose
// output the host sees.
//
// What is exercised, letter by letter:
//   a  the two controllers: the gates closed at reset, the reset values,
//      the sixteen vectors, and which controller reaches the bus matrix
//   b  a memory-to-memory block, byte-exact, with its flags in order
//   c  what the driver refuses, and that a refusal writes nothing
//   d  the FIFO: table 49 accepted and refused cell by cell, and every
//      accepted one moving its block exactly
//   e  the throughput ladder: bytes per core cycle for each width and
//      each memory burst
//   f  the counting rules: table 48, the alignments, a packed transfer
//   g  circular mode on the console's transmitter: laps, the reload, and
//      where the half-transfer flag falls
//   h  the double buffer: the two halves in turn, CT read back, and the
//      idle half replaced under a running stream
//   i  the abort and 10.3.14's resume: how long EN takes to come down
//      and what SxNDTR holds when it does
//   j  a transfer error: an address no DMA master reaches
//   k  priority arbitration between two streams of one controller
//   l  the console through the DMA engines: the Uart task with both
//      slots filled, measured against its own bit rate
//   r  (not in z) the receive engine, harvesting a line the host sends:
//      brio run <board> "rhello dma"
//
// build: boards = f429zi,f446re,f411ce,f469ni
// build: monitor_speed = 115200

#include <stdint.h>

#include <span>

#include "stm32f4/clock.hpp"
#include "stm32f4/dma.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx) || defined(STM32F469xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

namespace {

using namespace brio;

// ---- the console, and the cells its requests sit on --------------------------
//
// The board's console instance decides which (controller, stream,
// channel) the two engines take: USART1 is DMA2's stream 7 channel 4 out
// and stream 2 channel 4 in; USART2 is DMA1's stream 6 and stream 5, both
// channel 4 (RM0090 tables 43 and 44, and their RM0390 / RM0383 twins);
// USART3 is DMA1's stream 3 channel 4 out and stream 1 channel 4 in
// (RM0386 table 29). The Uart checks the cells at compile time - these
// lines only have to name the right ones.
#if defined(STM32F446xx)
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
using ConsoleTxStream = DmaStream<1, 6>;
using ConsoleTxEngine = DmaTxEngine<1, 6, 4>;
using ConsoleRxEngine = DmaRxEngine<1, 5, 4>;
#elif defined(STM32F469xx)
constexpr UartPins console_pins{.tx = {'B', 10, PinFunction::af7}, .rx = {'B', 11, PinFunction::af7}};
constexpr uint8_t console_instance = 3;
using ConsoleTxStream = DmaStream<1, 3>;
using ConsoleTxEngine = DmaTxEngine<1, 3, 4>;
using ConsoleRxEngine = DmaRxEngine<1, 1, 4>;
#else
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
using ConsoleTxStream = DmaStream<2, 7>;
using ConsoleTxEngine = DmaTxEngine<2, 7, 4>;
using ConsoleRxEngine = DmaRxEngine<2, 2, 4>;
#endif
constexpr uint8_t console_tx_channel = 4;

using Console = Usart<console_instance>;
using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

/// The same port with both engine slots filled - a SECOND type on the
/// same instance, so letter l can hand the peripheral over and take it
/// back without either transport knowing about the other.
constexpr uint32_t rx_ring_bytes = 64;
using DmaSerial = Uart<console_instance, console_pins, rx_ring_bytes, 256, ConsoleTxEngine,
                       ConsoleRxEngine>;

/// And the same port again in SINGLE-WIRE HALF DUPLEX, which is what
/// gives the receive engine a stimulus with no wire at all: with HDSEL
/// the receiver listens on the transmit pad, so everything the port
/// sends it also hears (30.3.10). Both engines, both directions, one
/// pad.
constexpr UartOptions loop_options{.half_duplex = true};
using LoopSerial = Uart<console_instance, console_pins, rx_ring_bytes, 256, ConsoleTxEngine,
                        ConsoleRxEngine, loop_options>;

TestBench<Serial> bench;

// ---- the wireless instrument: memory to memory on DMA2 ------------------------

using Block = Dma<2>;
using Work = DmaStream<2, 0>;    ///< the worker of most letters
using Rival = DmaStream<2, 3>;   ///< the second stream of the arbitration letter

constexpr uint16_t buffer_bytes = 2048;
alignas(4) volatile uint8_t src[buffer_bytes];
alignas(4) volatile uint8_t dst[buffer_bytes];

constexpr uint16_t rival_bytes = 512;
alignas(4) volatile uint8_t rival_src[rival_bytes];
alignas(4) volatile uint8_t rival_dst[rival_bytes];

/// The core-coupled memory's address. On the parts that HAVE a CCM it is
/// the one RAM the bus matrix does not let a DMA master reach (RM0090
/// 2.3: the CCM hangs off the CPU's own D-bus); on the parts that have
/// not, nothing is mapped there. Either way a stream pointed at it takes
/// a bus error, which is letter j's whole point.
constexpr uint32_t unreachable_address = 0x1000'0000u;

