uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
void fill_source() {
    for (uint16_t i = 0; i < buffer_bytes; ++i) {
        src[i] = static_cast<uint8_t>(i * 7u + 1u);
        dst[i] = 0;
    }
}

bool same(uint16_t bytes) {
    for (uint16_t i = 0; i < bytes; ++i) {
        if (dst[i] != src[i]) {
            return false;
        }
    }
    return true;
}

bool untouched_after(uint16_t bytes) {
    for (uint16_t i = bytes; i < buffer_bytes; ++i) {
        if (dst[i] != 0u) {
            return false;
        }
    }
    return true;
}

/// A memory-to-memory transfer of `count` items of `width`, source and
/// destination both walking. Direct mode is forbidden here (10.3.6), so
/// the FIFO is always on and the threshold is an argument.
DmaTransfer mem_to_mem(uint16_t count, DmaWidth width, DmaBurst memory_burst,
                       DmaFifoThreshold threshold, DmaPriority priority = DmaPriority::low) {
    DmaTransfer t{};
    t.peripheral = src;
    t.memory = dst;
    t.count = count;
    t.config.direction = DmaDirection::memory_to_memory;
    t.config.peripheral_increment = true;
    t.config.memory_increment = true;
    t.config.peripheral_width = width;
    t.config.memory_width = width;
    t.config.memory_burst = memory_burst;
    t.config.priority = priority;
    t.config.use_fifo = true;
    t.config.fifo_threshold = threshold;
    return t;
}

/// Wait for a stream to raise its completion flag. Bounded: a wrong
/// configuration must show as a failed letter, never as a dead board.
template <typename Stream>
bool wait_complete(uint32_t spins = 4'000'000u) {
    while (!Stream::flag(DmaFlag::complete)) {
        if (spins-- == 0u) {
            return false;
        }
    }
    return true;
}

// ---- the rulers ---------------------------------------------------------------

constexpr uint32_t cycles_per_us = SysClock::hz / 1'000'000u;

uint32_t systick_period() { return SysTick->LOAD + 1u; }

/// SysTick counts DOWN, so a later sample is a smaller number - unless
/// the period wrapped between the two, which at 1000 Hz means the
/// measurement was longer than a millisecond and is not to be trusted.
uint32_t val_delta(uint32_t first, uint32_t second) {
    return first >= second ? first - second : first + systick_period() - second;
}

/// Run one memory-to-memory transfer and report the core cycles it took,
/// or 0 when it did not complete.
uint32_t timed_block(const DmaTransfer& t) {
    if (!Work::prepare(t)) {
        return 0;
    }
    const uint32_t v0 = SysTick->VAL;
    if (!Work::trigger()) {
        return 0;
    }
    if (!wait_complete<Work>()) {
        return 0;
    }
    const uint32_t took = val_delta(v0, SysTick->VAL);
    return took;
}

// ---- what the registers held before this program touched them ----------------

struct BootState {
    bool gate1 = false, gate2 = false;
    uint32_t lisr1 = 0, hisr1 = 0, lisr2 = 0, hisr2 = 0;
    uint32_t cr = 0, fcr = 0, ndtr = 0;
};
BootState boot;

// ---- the console, quiesced -----------------------------------------------------
//
// Letters g, h and i drive the console's TRANSMITTER from a DMA stream,
// which means taking the data register from the interrupt-driven
// transport for the length of the letter. The handover is safe only with
// the ring drained and the shifter empty, and 10.3.17's warning says the
// stream goes off before the peripheral's request bit does.

void quiesce_console() {
    uint32_t spins = 4'000'000u;
    while (!Serial::tx_idle() && spins-- != 0u) {
    }
    spins = 400'000u;
    while (!Console::tx_complete() && spins-- != 0u) {
    }
}

void release_console_stream() {
    ConsoleTxStream::stop();
    Console::dma_transmit(false);
}

// ---- a  the two controllers ----------------------------------------------------

void ta_block() {
    bench.verdict("both gates are closed at reset", !boot.gate1 && !boot.gate2);
    print(serial, "  reset: LISR1=", hex(boot.lisr1), " HISR1=", hex(boot.hisr1),
          " LISR2=", hex(boot.lisr2), " HISR2=", hex(boot.hisr2), crlf);
    bench.verdict("no flag stands at reset",
                  boot.lisr1 == 0u && boot.hisr1 == 0u && boot.lisr2 == 0u && boot.hisr2 == 0u);
    print(serial, "  reset: S0CR=", hex(boot.cr), " S0FCR=", hex(boot.fcr), " S0NDTR=",
          boot.ndtr, crlf);
    bench.verdict("a stream comes up idle, its FIFO register at 0x21",
                  boot.cr == 0u && boot.fcr == 0x21u && boot.ndtr == 0u);

    Block::init();
    bench.verdict("init opens the gate", Block::bus_clock());

    // The reset line puts a configured stream back where it started.
    (void)Work::configure(DmaStreamConfig{.channel = 5, .priority = DmaPriority::very_high});
    const bool written = Work::channel() == 5u;
    Block::reset();
    bench.verdict("a configured stream is written and the block reset clears it",
                  written && Work::control() == 0u && Work::fifo_control() == 0x21u);

    print(serial, "  streams=", static_cast<uint32_t>(Block::streams),
          " channels=", static_cast<uint32_t>(dma_channels),
          " fifo=", static_cast<uint32_t>(dma_fifo_words), " words", crlf);
    bench.verdict("eight streams, eight channels, a four-word FIFO",
                  Block::streams == 8u && dma_channels == 8u && dma_fifo_words == 4u);

    // Sixteen vectors and no two the same: checked here over the whole
    // pair, because a shared line would make an ISR body answer for
    // somebody else's stream.
    bool distinct = true;
    for (uint8_t a = 0; a < 16u; ++a) {
        for (uint8_t b = static_cast<uint8_t>(a + 1u); b < 16u; ++b) {
            const IRQn_Type ia = dma_stream_irq(static_cast<uint8_t>(1u + a / 8u), a % 8u);
            const IRQn_Type ib = dma_stream_irq(static_cast<uint8_t>(1u + b / 8u), b % 8u);
            if (ia == ib) {
                distinct = false;
            }
        }
    }
    bench.verdict("one vector per stream, sixteen of them, all distinct", distinct);

    bench.verdict("memory to memory is DMA2's alone",
                  Dma<2>::memory_to_memory && !Dma<1>::memory_to_memory);
}

// ---- b  a memory-to-memory block -----------------------------------------------

void tb_memory_to_memory() {
    Block::init();
    fill_source();
    constexpr uint16_t bytes = 256;
    const DmaTransfer t = mem_to_mem(bytes, DmaWidth::byte, DmaBurst::single,
                                     DmaFifoThreshold::full);
    bench.verdict("the transfer is accepted", Work::prepare(t));
    bench.verdict("prepared and not running", !Work::enabled() && Work::count() == bytes);
    const bool up = Work::trigger();
    const bool done = wait_complete<Work>();
    bench.verdict("it starts on the enable alone - no peripheral asks", up && done);

