uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
    print(serial, "  ", bytes, " bytes, NDTR=", Work::count(), " flags=", hex(Work::flags()),
          " EN=", Work::enabled() ? 1u : 0u, crlf);
    bench.verdict("the block is byte-exact", same(bytes));
    bench.verdict("and nothing past it was written", untouched_after(bytes));
    bench.verdict("NDTR reached zero", Work::count() == 0u);
    bench.verdict("the hardware cleared EN at the end", !Work::enabled());
    bench.verdict("the completion flag stands, alone",
                  Work::flag(DmaFlag::complete) && !Work::flag(DmaFlag::errors));
    Work::clear(DmaFlag::all);
    bench.verdict("and the clear register takes it away", Work::flags() == 0u);

    // THE READ-BACK THAT WEDGES: on the STM32F446 a load of SxCR in the
    // cycles after the EN store wedges the stream every other time -
    // sixteen bytes into the FIFO, nothing drains, EN standing, no flag,
    // until the controller is reset. Four blocks enabled with a read of
    // EN right after the store, reported and not judged (the F429 takes
    // them all, the F411 wedges like the F446); then four with the store
    // left alone, which is
    // what enable() does, and which every part completes.
    uint8_t wedged = 0;
    for (uint8_t k = 0; k < 4u; ++k) {
        Work::stop();
        if (Work::enabled()) {
            Block::init();
        }
        (void)Work::prepare(t);
        Work::regs().CR = Work::regs().CR | DMA_SxCR_EN;
        (void)Work::enabled();   // the load right after the store
        if (!wait_complete<Work>(200'000u)) {
            ++wedged;
        }
    }
    print(serial, "  four blocks enabled with SxCR read back right after the store: ", wedged,
          " wedged (NDTR ", Work::count(), " of ", bytes, " on the last)", crlf);
    if (Work::enabled()) {
        Block::init();
    }
    uint8_t alone = 0;
    for (uint8_t k = 0; k < 4u; ++k) {
        Work::stop();
        if (Work::prepare(t) && Work::trigger() && wait_complete<Work>(200'000u) && same(bytes)) {
            ++alone;
        }
    }
    bench.verdict("four blocks back to back with the enable's store left alone all complete",
                  alone == 4u);

    // AND THE ENABLE IS THE ONE STORE THAT DOES NOT READ BACK AT ONCE.
    // A plain register - SxNDTR here, which has no side effect on a
    // stopped stream - is visible to the very next load; EN is not, and
    // the verdict above is what stands guard over that: enable() polls
    // its read-back, and a version that trusted one read reported this
    // running stream as a refused one.
    Work::stop();
    (void)Work::set_count(0x5A5Au);
    uint32_t slack = 0;
    while (Work::count() != 0x5A5Au && slack < 8u) {
        ++slack;
    }
    print(serial, "  SxNDTR reads back after ", slack, " stale read(s); EN takes one more",
          crlf);
    bench.verdict("a plain stream register reads back at once", slack == 0u);
    Work::stop();
}

// ---- c  what the driver refuses ------------------------------------------------

void tc_refusals() {
    Block::init();
    Dma<1>::init();
    const DmaTransfer good = mem_to_mem(64, DmaWidth::byte, DmaBurst::single,
                                        DmaFifoThreshold::full);

    bench.verdict("memory to memory on DMA1 is refused - its peripheral port "
                  "does not reach the bus matrix",
                  !DmaStream<1, 0>::configure(good.config));
    bench.verdict("and accepted on DMA2", Work::configure(good.config));

    DmaStreamConfig c = good.config;
    c.circular = true;
    bench.verdict("memory to memory with circular mode is refused",
                  !Work::configure(c));
    c = good.config;
    c.use_fifo = false;
    bench.verdict("memory to memory in direct mode is refused", !Work::configure(c));
    c = good.config;
    c.double_buffer = true;
    bench.verdict("memory to memory with the double buffer is refused",
                  !Work::configure(c));
    c = good.config;
    c.peripheral_flow_control = true;
    c.circular = true;
    c.direction = DmaDirection::peripheral_to_memory;
    bench.verdict("a circular stream under the peripheral flow controller is refused",
                  !Work::configure(c));
    c = good.config;
    c.direction = DmaDirection::peripheral_to_memory;
    c.use_fifo = false;
    c.memory_width = DmaWidth::word;
    bench.verdict("direct mode with two different widths is refused", !Work::configure(c));
    c.memory_width = DmaWidth::byte;
    c.memory_burst = DmaBurst::incr4;
    bench.verdict("direct mode with a burst is refused", !Work::configure(c));
    c = good.config;
    c.channel = 8;
    bench.verdict("a ninth channel is refused", !Work::configure(c));

    // A refusal writes NOTHING: the register still holds what the last
    // accepted configuration put there.
    (void)Work::configure(good.config);
    const uint32_t before = Work::control();
    c = good.config;
    c.channel = 8;
    (void)Work::configure(c);
    bench.verdict("a refused configuration leaves the register alone",
                  Work::control() == before);

    // Transfers, not configurations.
    DmaTransfer t = good;
    t.memory = nullptr;
    bench.verdict("a transfer with no destination is refused", !Work::prepare(t));
    t = good;
    t.count = 0;
    bench.verdict("a zero count is refused - it would serve nothing", !Work::prepare(t));
    t = good;
    t.config.peripheral_width = DmaWidth::word;
    t.config.memory_width = DmaWidth::word;
    t.peripheral = &src[1];
    bench.verdict("a word transfer from an unaligned address is refused",
                  !Work::prepare(t));

    // And SxCR is read-only while EN is set, so configure() refuses then
    // instead of storing into a register the silicon ignores.
    const DmaTransfer big = mem_to_mem(buffer_bytes, DmaWidth::byte, DmaBurst::single,
                                       DmaFifoThreshold::full);
    (void)Work::load(big);
    const bool refused_running = !Work::configure(good.config);
    (void)wait_complete<Work>();
    Work::stop();
    bench.verdict("a running stream refuses to be reconfigured", refused_running);
}

// ---- d  the FIFO, table 49 ------------------------------------------------------

void td_fifo() {
    Block::init();
    fill_source();

    constexpr DmaFifoThreshold thresholds[4] = {
        DmaFifoThreshold::quarter, DmaFifoThreshold::half, DmaFifoThreshold::three_quarters,
        DmaFifoThreshold::full};
    constexpr DmaBurst bursts[4] = {DmaBurst::single, DmaBurst::incr4, DmaBurst::incr8,
                                    DmaBurst::incr16};
    constexpr DmaWidth widths[3] = {DmaWidth::byte, DmaWidth::half, DmaWidth::word};

