uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
    uint8_t accepted = 0, refused = 0, exact = 0, moved = 0;
    for (uint8_t w = 0; w < 3u; ++w) {
        for (uint8_t th = 0; th < 4u; ++th) {
            for (uint8_t b = 0; b < 4u; ++b) {
                const uint16_t items = static_cast<uint16_t>(256u / dma_width_bytes(widths[w]));
                const DmaTransfer t = mem_to_mem(items, widths[w], bursts[b], thresholds[th]);
                const bool legal = dma_fifo_burst_valid(thresholds[th], bursts[b], widths[w],
                                                        DmaBurst::single, widths[w]);
                for (uint16_t i = 0; i < buffer_bytes; ++i) {
                    dst[i] = 0;
                }
                const bool taken = Work::prepare(t);
                if (taken != legal) {
                    continue;
                }
                if (!legal) {
                    ++refused;
                    continue;
                }
                ++accepted;
                if (!Work::trigger() || !wait_complete<Work>()) {
                    continue;
                }
                ++moved;
                if (same(256) && untouched_after(256) && !Work::flag(DmaFlag::fifo_error)) {
                    ++exact;
                }
                Work::stop();
            }
        }
    }
    print(serial, "  table 49 over 48 cells: ", accepted, " accepted, ", refused,
          " refused, ", moved, " run, ", exact, " byte-exact with no FIFO error", crlf);
    // Twelve single-burst cells are always legal; table 49 adds seven for
    // the byte width, three for the half-word and one for the word.
    bench.verdict("every cell of table 49 answers as the table says",
                  accepted + refused == 48u);
    bench.verdict("twenty-three of the forty-eight are legal", accepted == 23u);
    bench.verdict("and every legal one moves its block exactly", exact == accepted);
}

// ---- e  the throughput ladder ---------------------------------------------------

void te_throughput() {
    Block::init();
    fill_source();
    print(serial, "  ", buffer_bytes, " bytes at ", SysClock::hz / 1'000'000u,
          " MHz, memory to memory, source and destination in SRAM:", crlf);

    constexpr DmaBurst bursts[3] = {DmaBurst::single, DmaBurst::incr4, DmaBurst::incr8};
    constexpr DmaWidth widths[3] = {DmaWidth::byte, DmaWidth::half, DmaWidth::word};
    uint8_t ran = 0, exact = 0;
    uint32_t single_of[3] = {0, 0, 0};   ///< the single-beat cycles per width
    uint32_t burst_best[3] = {0, 0, 0};  ///< the best BURST cycles per width
    for (uint8_t w = 0; w < 3u; ++w) {
        for (uint8_t b = 0; b < 3u; ++b) {
            const uint8_t bytes_per = dma_width_bytes(widths[w]);
            const uint16_t items = static_cast<uint16_t>(buffer_bytes / bytes_per);
            // BOTH PORTS BURST TOGETHER, which is the configuration a
            // real block copy would use; table 49's arithmetic is what
            // decides whether the pair exists at all.
            if (!dma_fifo_burst_valid(DmaFifoThreshold::full, bursts[b], widths[w], bursts[b],
                                      widths[w])) {
                continue;
            }
            for (uint16_t i = 0; i < buffer_bytes; ++i) {
                dst[i] = 0;
            }
            DmaTransfer t = mem_to_mem(items, widths[w], bursts[b], DmaFifoThreshold::full);
            t.config.peripheral_burst = bursts[b];
            const uint32_t cycles = timed_block(t);
            Work::stop();
            ++ran;
            const bool ok = cycles != 0u && same(buffer_bytes);
            if (ok) {
                ++exact;
            }
            if (b == 0u) {
                single_of[w] = cycles;
            } else if (cycles != 0u && (burst_best[w] == 0u || cycles < burst_best[w])) {
                burst_best[w] = cycles;
            }
            const uint32_t per100 = cycles == 0u ? 0u : (buffer_bytes * 100u) / cycles;
            print(serial, "    ", static_cast<uint32_t>(bytes_per), "-byte beats, burst ",
                  static_cast<uint32_t>(dma_burst_beats(bursts[b])), ": ", cycles, " cycles (",
                  per100, " bytes per 100 cycles, ", cycles / cycles_per_us, " us)",
                  ok ? "" : "  MISMATCH", crlf);
        }
    }
    bench.verdict("every width and burst moved the block exactly", ran != 0u && exact == ran);
    // The WIDTH is what buys the throughput - a word beat moves four
    // bytes for the same two bus accesses a byte beat pays for.
    bench.verdict("the wider the beat, the fewer the cycles",
                  single_of[2] != 0u && single_of[2] < single_of[1] &&
                      single_of[1] < single_of[0]);
    print(serial, "    bursting both ports against single beats: ", single_of[0], " -> ",
          burst_best[0], " (byte), ", single_of[1], " -> ", burst_best[1], " (half), ",
          single_of[2], " -> ", burst_best[2], " (word) cycles", crlf);
}

// ---- f  the counting rules ------------------------------------------------------

void tf_counting() {
    Block::init();
    fill_source();

    // Table 48: a peripheral port narrower than the memory port packs,
    // and the last access would be incomplete unless the count divides.
    DmaTransfer t = mem_to_mem(64, DmaWidth::byte, DmaBurst::single, DmaFifoThreshold::full);
    t.config.memory_width = DmaWidth::word;
    t.count = 63;
    bench.verdict("table 48: a byte source into word writes refuses a count of 63",
                  !Work::prepare(t));
    t.count = 64;
    const bool taken = Work::prepare(t);
    const bool ran = taken && Work::trigger() && wait_complete<Work>();
    print(serial, "  packed 64 bytes into 16 words, NDTR=", Work::count(), crlf);
    bench.verdict("and accepts 64", taken);
    bench.verdict("the packed block is byte-exact, little-endian", ran && same(64));
    bench.verdict("NDTR counts PERIPHERAL-side items, so it reached zero from 64",
                  Work::count() == 0u);
    Work::stop();

    // Alignment: the address is aligned on the width of the accesses
    // made through it, both ends.
    t = mem_to_mem(32, DmaWidth::half, DmaBurst::single, DmaFifoThreshold::full);
    t.memory = &dst[1];
    bench.verdict("a half-word destination at an odd address is refused",
                  !Work::prepare(t));
    t.memory = &dst[2];
    bench.verdict("and accepted two bytes along", Work::prepare(t));
    Work::stop();

    // The circular note of 10.3.8: under CIRC a memory burst must divide
    // the block. Checked as a refusal, since a circular memory-to-memory
    // stream does not exist to run.
    DmaStreamConfig c{};
    c.direction = DmaDirection::peripheral_to_memory;
    c.circular = true;
    c.memory_increment = true;
    c.memory_burst = DmaBurst::incr8;
    c.use_fifo = true;
    c.fifo_threshold = DmaFifoThreshold::full;
    DmaTransfer ct{};
    ct.peripheral = Console::data_address();
    ct.memory = dst;
    ct.config = c;
    ct.count = 12;
    bench.verdict("10.3.8: a circular block that is not a whole number of memory "
                  "bursts is refused",
                  !Rival::prepare(ct));
    ct.count = 16;
    bench.verdict("and one that is, accepted", Rival::prepare(ct));
    Rival::stop();
}

// ---- g  circular mode, on the console's transmitter ------------------------------

void tg_circular() {
    Block::init();
    Dma<1>::init();
    constexpr uint8_t lap_bytes = 16;
    static const char table[lap_bytes] = {'[', 'c', 'i', 'r', 'c', 'u', 'l', 'a',
                                          'r', ' ', 'l', 'a', 'p', ']', '\r', '\n'};

    quiesce_console();
    Console::dma_transmit(true);

    DmaTransfer t{};
    t.peripheral = Console::data_address();
    t.memory = const_cast<char*>(table);
    t.count = lap_bytes;
    t.config.channel = console_tx_channel;
    t.config.direction = DmaDirection::memory_to_peripheral;
    t.config.circular = true;
    t.config.memory_increment = true;
    const bool taken = ConsoleTxStream::load(t);

    // Five laps at the console's own bit rate: every lap is the same
    // sixteen bytes and the host sees them all. Nothing re-arms anything
    // - the controller reloads NDTR and the address itself.
    uint8_t laps = 0;
    uint16_t half_seen = 0;
    uint32_t spins = 8'000'000u;
    while (laps < 5u && spins-- != 0u) {
        if (ConsoleTxStream::flag(DmaFlag::half) && half_seen == 0u) {
            half_seen = ConsoleTxStream::count();
        }
        if (ConsoleTxStream::flag(DmaFlag::complete)) {
            ConsoleTxStream::clear(DmaFlag::complete | DmaFlag::half);
            ++laps;
        }
    }
    const uint16_t reloaded = ConsoleTxStream::count();
    const bool still_running = ConsoleTxStream::enabled();
    release_console_stream();
    quiesce_console();

    bench.verdict("the circular transfer is accepted", taken);
    print(serial, "  laps=", laps, " NDTR after the wrap=", reloaded,
          " half-transfer flag at NDTR=", half_seen, crlf);
    bench.verdict("five laps ran with nothing re-arming them", laps == 5u);
    bench.verdict("the stream is still enabled after the wrap", still_running);
    bench.verdict("NDTR reloaded itself", reloaded != 0u && reloaded <= lap_bytes);
    bench.verdict("the half-transfer flag falls at the half", half_seen != 0u &&
                                                                  half_seen <= lap_bytes / 2u);
}

// ---- h  the double buffer ---------------------------------------------------------

