uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
void th_double_buffer() {
    Block::init();
    Dma<1>::init();
    constexpr uint8_t lap_bytes = 12;
    static const char first[lap_bytes] = {'[', 'b', 'u', 'f', 'f', 'e',
                                          'r', ' ', 'A', ']', '\r', '\n'};
    static const char second[lap_bytes] = {'[', 'b', 'u', 'f', 'f', 'e',
                                           'r', ' ', 'B', ']', '\r', '\n'};
    static const char third[lap_bytes] = {'[', 'b', 'u', 'f', 'f', 'e',
                                          'r', ' ', 'C', ']', '\r', '\n'};

    quiesce_console();
    Console::dma_transmit(true);

    DmaTransfer t{};
    t.peripheral = Console::data_address();
    t.memory = const_cast<char*>(first);
    t.memory1 = const_cast<char*>(second);
    t.count = lap_bytes;
    t.config.channel = console_tx_channel;
    t.config.direction = DmaDirection::memory_to_peripheral;
    t.config.double_buffer = true;
    t.config.memory_increment = true;
    const bool taken = ConsoleTxStream::load(t);
    const bool circular_forced = ConsoleTxStream::circular();
    const bool starts_on_m0 = !ConsoleTxStream::current_target_is_m1();

    // Four laps, reading CT at each: the hardware swaps the target at
    // every end of transaction, which is what makes the mode worth its
    // name.
    uint8_t laps = 0, flips = 0;
    bool target = ConsoleTxStream::current_target_is_m1();
    bool swapped_live = false;
    uint32_t spins = 8'000'000u;
    while (laps < 4u && spins-- != 0u) {
        if (ConsoleTxStream::flag(DmaFlag::complete)) {
            ConsoleTxStream::clear(DmaFlag::complete | DmaFlag::half);
            ++laps;
            const bool now = ConsoleTxStream::current_target_is_m1();
            if (now != target) {
                ++flips;
            }
            target = now;
            if (laps == 2u) {
                // 10.3.9's window: at the completion the target has just
                // changed, so the OTHER half is the one that may be
                // written - and the driver reads CT to know which.
                swapped_live = ConsoleTxStream::set_idle_buffer(const_cast<char*>(third));
            }
        }
    }
    const bool no_error = !ConsoleTxStream::flag(DmaFlag::transfer_error);
    release_console_stream();
    quiesce_console();

    bench.verdict("the double-buffer transfer is accepted", taken);
    bench.verdict("the double buffer forces circular mode", circular_forced);
    bench.verdict("the first lap runs from memory 0", starts_on_m0);
    print(serial, "  laps=", laps, " target flips=", flips, crlf);
    bench.verdict("four laps ran", laps == 4u);
    bench.verdict("the target flipped at every one", flips == 4u);
    bench.verdict("the idle half was replaced under a running stream", swapped_live);
    bench.verdict("and writing the idle half raised no transfer error", no_error);
}

// ---- i  the abort, and 10.3.14's resume --------------------------------------------

void ti_abort() {
    Block::init();
    Dma<1>::init();
    fill_source();

    // First: how long EN takes to come down on a stream that is not
    // running at all, and on one in the middle of a memory-to-memory
    // block. The chapter's claim is that the disable waits for the
    // current transfer AND the FIFO flush.
    const uint32_t v0 = SysTick->VAL;
    const bool idle_down = Work::abort();
    const uint32_t idle_cycles = val_delta(v0, SysTick->VAL);

    (void)Work::load(mem_to_mem(buffer_bytes, DmaWidth::byte, DmaBurst::single,
                                DmaFifoThreshold::full));
    const uint32_t v1 = SysTick->VAL;
    const bool mid_down = Work::abort();
    const uint32_t mid_cycles = val_delta(v1, SysTick->VAL);
    const uint16_t left = Work::count();
    const bool flushed_complete = Work::flag(DmaFlag::complete);
    Work::stop();

    print(serial, "  abort: idle ", idle_cycles, " cycles, mid-block ", mid_cycles,
          " cycles, NDTR left ", left, " of ", buffer_bytes, crlf);
    bench.verdict("EN comes down on an idle stream at once", idle_down);
    bench.verdict("and on a running one, after the flush", mid_down);
    bench.verdict("the disable costs more than the idle one", mid_cycles >= idle_cycles);
    bench.verdict("SxNDTR says how much of the block was left", left != 0u &&
                                                                    left < buffer_bytes);
    bench.verdict("10.3.14: the flush raises the completion flag as well",
                  flushed_complete);

    // Then the resume of 10.3.14, on the console's transmitter because it
    // is slow enough to be interrupted in the middle: send 120 bytes,
    // stop after a millisecond, and finish the rest from where SxNDTR
    // says the block got to.
    constexpr uint16_t run = 120;
    static char line[run];
    for (uint16_t i = 0; i < run; ++i) {
        line[i] = static_cast<char>('0' + (i % 10u));
    }
    line[run - 2] = '\r';
    line[run - 1] = '\n';

    quiesce_console();
    Console::dma_transmit(true);
    DmaTransfer t{};
    t.peripheral = Console::data_address();
    t.memory = line;
    t.count = run;
    t.config.channel = console_tx_channel;
    t.config.direction = DmaDirection::memory_to_peripheral;
    t.config.memory_increment = true;
    const bool started = ConsoleTxStream::load(t);
    const uint32_t mark = Ticker::millis();
    while (Ticker::millis() - mark < 2u) {
    }
    const bool stopped = ConsoleTxStream::abort();
    const uint16_t remaining = ConsoleTxStream::count();
    ConsoleTxStream::clear(DmaFlag::all);

    // The three steps the chapter names: the address forward by what was
    // sent, the count to what is left, the enable again.
    t.memory = &line[run - remaining];
    t.count = remaining;
    const bool resumed = remaining != 0u && ConsoleTxStream::load(t);
    const bool finished = resumed && wait_complete<ConsoleTxStream>();
    release_console_stream();
    quiesce_console();

    print(serial, "  suspended after ", run - remaining, " of ", run,
          " bytes, resumed and finished", crlf);
    bench.verdict("a peripheral-paced block starts", started);
    bench.verdict("and stops in the middle", stopped && remaining != 0u &&
                                                  remaining < run);
    bench.verdict("10.3.14's resume finishes the rest", finished);
}

// ---- j  a transfer error ------------------------------------------------------------

