uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
void tj_transfer_error() {
    Block::init();
    fill_source();

    DmaTransfer t = mem_to_mem(64, DmaWidth::byte, DmaBurst::single, DmaFifoThreshold::full);
    t.memory = reinterpret_cast<volatile void*>(unreachable_address);
    const bool taken = Work::prepare(t);
    const bool up = Work::trigger();

    uint32_t spins = 2'000'000u;
    while (!Work::flag(DmaFlag::transfer_error) && spins-- != 0u) {
    }
    const uint32_t flags = Work::flags();
    const bool still_enabled = Work::enabled();
    const uint16_t left = Work::count();

    // With the error standing the stream is dead where it is: its
    // destination has not changed, so an enable faults again on the
    // first beat. What proves the stream RECOVERS is a good block after
    // the flags are cleared.
    (void)Work::abort();
    Work::clear(DmaFlag::all);
    fill_source();
    const bool recovered = Work::load(mem_to_mem(64, DmaWidth::byte, DmaBurst::single,
                                                 DmaFifoThreshold::full)) &&
                           wait_complete<Work>() && same(64);
    Work::stop();

    print(serial, "  writing to ", hex(unreachable_address), ": flags=", hex(flags),
          " EN=", still_enabled ? 1u : 0u, " NDTR=", left, " of 64", crlf);
    bench.verdict("the transfer is accepted - nothing in the driver knows the address "
                  "is unreachable",
                  taken);
    print(serial, "  the enable answered ", up ? "true" : "false",
          " - whether the stream is already dead when the read-back sees it is a race "
          "the core clock decides", crlf);
    bench.verdict("an address no DMA master reaches raises TEIF",
                  (flags & DmaFlag::transfer_error) != 0u);
    bench.verdict("and the hardware clears EN with it", !still_enabled);
    bench.verdict("no FIFO or direct-mode error came with it",
                  (flags & (DmaFlag::fifo_error | DmaFlag::direct_mode_error)) == 0u);
    bench.verdict("SxNDTR says where the block died", left != 0u && left < 64u);
    bench.verdict("a cleared stream takes the next block", recovered);
}

// ---- k  priority arbitration ----------------------------------------------------------

void tk_priority() {
    Block::init();
    for (uint16_t i = 0; i < rival_bytes; ++i) {
        rival_src[i] = static_cast<uint8_t>(i);
        rival_dst[i] = 0;
    }
    fill_source();

    // The same block on two streams of one controller, competing for the
    // same two AHB ports. Only the software half of the arbitration is
    // configurable (10.3.4); the hardware half is the stream index, and
    // stream 0 outranks stream 3 on a tie - which is why the letter runs
    // the pair BOTH WAYS and compares.
    // `gap` puts a few cycles between the two enables. Back to back, the
    // second stream can STALL after its first FIFO fill on one part of the
    // family (measured below, reported and not judged); the timed races
    // keep the gap so that what they measure is the arbitration.
    auto race = [](DmaPriority work, DmaPriority rival, bool gap) {
        DmaTransfer a = mem_to_mem(rival_bytes, DmaWidth::byte, DmaBurst::single,
                                   DmaFifoThreshold::full, work);
        DmaTransfer b = a;
        b.peripheral = rival_src;
        b.memory = rival_dst;
        b.config.priority = rival;
        (void)Work::prepare(a);
        (void)Rival::prepare(b);
        const uint32_t v0 = SysTick->VAL;
        (void)Work::trigger();
        if (gap) {
            for (uint8_t k = 0; k < 8u; ++k) {
                __NOP();
            }
        }
        (void)Rival::trigger();
        uint32_t first = 0, second = 0;
        uint32_t spins = 400'000u;
        while ((first == 0u || second == 0u) && spins-- != 0u) {
            if (first == 0u && Work::flag(DmaFlag::complete)) {
                first = val_delta(v0, SysTick->VAL);
            }
            if (second == 0u && Rival::flag(DmaFlag::complete)) {
                second = val_delta(v0, SysTick->VAL);
            }
        }
        if (second == 0u) {
            print(serial, "    the second stream STALLED: EN=", Rival::enabled() ? 1u : 0u,
                  " NDTR=", Rival::regs().NDTR, " of ", rival_bytes, " flags=",
                  hex(Rival::flags()), crlf);
        }
        Work::stop();
        Rival::stop();
        return static_cast<uint64_t>(first) << 32 | second;
    };

    // What the same block costs with nobody to share the ports with -
    // the yardstick both racers are measured against.
    const uint32_t alone =
        timed_block(mem_to_mem(rival_bytes, DmaWidth::byte, DmaBurst::single,
                               DmaFifoThreshold::full));
    Work::stop();

    // First the back-to-back start, both ways, as a probe: does the second
    // enable's stream run at all?
    print(serial, "  two enables back to back, the low stream second:", crlf);
    const uint64_t bb = race(DmaPriority::very_high, DmaPriority::low, false);
    const bool stalled = static_cast<uint32_t>(bb) == 0u;
    print(serial, "    ", stalled ? "the low stream stalled and never finished"
                                  : "both streams finished", crlf);
    const uint64_t low_high = race(DmaPriority::low, DmaPriority::very_high, true);
    const uint32_t s0_low = static_cast<uint32_t>(low_high >> 32);
    const uint32_t s3_high = static_cast<uint32_t>(low_high);
    const uint64_t high_low = race(DmaPriority::very_high, DmaPriority::low, true);
    const uint32_t s0_high = static_cast<uint32_t>(high_low >> 32);
    const uint32_t s3_low = static_cast<uint32_t>(high_low);

    print(serial, "  ", rival_bytes, " bytes alone: ", alone, " cycles", crlf);
    print(serial, "  with a few cycles between the two enables:", crlf);
    print(serial, "  ", rival_bytes, " bytes each, both streams started together:", crlf);
    print(serial, "    stream 0 low + stream 3 very high: ", s0_low, " / ", s3_high,
          " cycles", crlf);
    print(serial, "    stream 0 very high + stream 3 low: ", s0_high, " / ", s3_low,
          " cycles", crlf);
    bench.verdict("both races finished", s0_low != 0u && s3_high != 0u && s0_high != 0u &&
                                             s3_low != 0u);
    bench.verdict("the very high stream finishes first, whichever index it has",
                  s3_high < s0_low && s0_high < s3_low);
    bench.verdict("and the loser pays for it", s0_low > s0_high && s3_low > s3_high);
    print(serial, "  what the winner pays for the company: ", s3_high, " and ", s0_high,
          " against ", alone, " alone - within the measurement", crlf);
    bench.verdict("both blocks arrived whole", same(rival_bytes));
    bench.verdict("and a stalled stream, if there was one, was recovered by stop()",
                  !Rival::enabled());
}

// ---- l  the console through the DMA engines ---------------------------------------

/// What letter l and letter r leave behind for the verdicts, which can
/// only be printed once the plain console is back.
struct EngineRun {
    bool up = false;
    uint32_t queued = 0;
    uint32_t millis = 0;
    uint8_t faults = 0;
    bool drained = false;
    uint16_t harvested = 0;
    bool rx_running = false;
    uint8_t hw_overruns = 0;   ///< ORE: a byte the receiver lost in silicon
    uint8_t rx_overruns = 0;   ///< the ring had no room for a new run
    uint8_t line_errors = 0;   ///< NE, FE, PE: each costs the byte in DR
    uint16_t first_gap = 0;    ///< where the echo first left the pattern
};

/// Which transport owns the port right now, for the two stream vectors
/// to dispatch on: 0 the plain interrupt-driven one, 1 the engined
/// console, 2 the engined half-duplex loop.
volatile uint8_t engined_console = 0;

