uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
/// Hand the port to `Port` (an engined Uart type), send `block` bytes
/// through the transmit stream, harvest for `rx_window_ms`, and give it
/// back. Nothing may print between the two swaps: the verdicts wait for
/// the plain console to come home.
template <typename Port>
EngineRun run_engined(uint8_t which, uint16_t block, uint32_t rx_window_ms) {
    EngineRun r{};
    static uint8_t line[64];
    for (uint16_t i = 0; i < sizeof(line); ++i) {
        line[i] = static_cast<uint8_t>('a' + (i % 26u));
    }
    line[sizeof(line) - 2] = '\r';
    line[sizeof(line) - 1] = '\n';

    quiesce_console();
    Serial::release();
    engined_console = which;
    r.up = Port::init(clock, 115200);
    if (!r.up) {
        engined_console = 0;
        (void)Serial::init(clock, 115200);
        return r;
    }
    r.rx_running = !ConsoleRxEngine::idle();
    Port::clear_errors();   // what the handover itself left behind is not the run's

    // THE HARVEST RIDES ALONG WITH THE SENDING, because that is how a
    // program uses this port: the receive run is the ring's free span,
    // and an owner that stops asking while the line is busy lets that
    // run fill and loses what arrives after it. On the half-duplex loop
    // everything sent comes straight back, so the two directions are
    // busy at once and the pacing is the whole test.
    const uint32_t t0 = Ticker::millis();
    for (;;) {
        if (r.queued < block) {
            r.queued += Port::write_bulk(std::span<const uint8_t>(line, sizeof(line)));
        }
        (void)Port::harvest();
        uint8_t taken = 0;
        while (Port::read_byte(taken)) {
            if (r.first_gap == 0u && taken != line[r.harvested % sizeof(line)]) {
                r.first_gap = static_cast<uint16_t>(r.harvested + 1u);
            }
            ++r.harvested;
        }
        if (r.queued >= block && Port::tx_idle()) {
            break;
        }
        if (Ticker::millis() - t0 > 3000u) {
            break;
        }
    }
    uint32_t spins = 400'000u;
    while (!Console::tx_complete() && spins-- != 0u) {
    }
    r.millis = Ticker::millis() - t0;
    r.drained = Port::tx_idle();

    // The tail: whatever is still in flight after the last byte left.
    const uint32_t r0 = Ticker::millis();
    while (Ticker::millis() - r0 <= rx_window_ms) {
        (void)Port::harvest();
        uint8_t byte = 0;
        while (Port::read_byte(byte)) {
            if (r.first_gap == 0u && byte != line[r.harvested % sizeof(line)]) {
                r.first_gap = static_cast<uint16_t>(r.harvested + 1u);
            }
            ++r.harvested;
        }
    }
    r.faults = Port::dma_faults();
    r.hw_overruns = Port::hw_overruns();
    r.rx_overruns = Port::rx_overruns();
    r.line_errors = static_cast<uint8_t>(Port::noise_errors() + Port::frame_errors() +
                                         Port::parity_errors());

    Port::release();
    engined_console = 0;
    (void)Serial::init(clock, 115200);
    return r;
}

void tl_engines() {
    Block::init();
    Dma<1>::init();
    const EngineRun r = run_engined<DmaSerial>(1, 512, 0);

    bench.verdict("the port comes up with both engine slots filled", r.up);
    bench.verdict("the receive engine is running from the first byte", r.rx_running);
    print(serial, "  ", r.queued, " bytes through the transmit stream in ", r.millis,
          " ms (", r.millis == 0u ? 0u : r.queued * 1000u / r.millis,
          " bytes/s at 115200 baud), dma faults ", r.faults, crlf);
    bench.verdict("the whole block was queued", r.queued >= 512u);
    bench.verdict("the ring drained through the stream", r.drained);
    bench.verdict("no block was thrown away", r.faults == 0u);
    // A byte is ten bits on the wire at 115200, so the block's own
    // length says how long it must have taken: the time measures the
    // LINE and not the ring, which is the whole claim of a DMA console.
    const uint32_t expected = r.queued * 10'000u / 115200u;
    print(serial, "  the line's own time for ", r.queued, " bytes is ", expected, " ms", crlf);
    bench.verdict("the time is the line's, not the CPU's",
                  r.millis + 5u >= expected && r.millis <= expected + 5u);
}

// ---- m  the receive engine, on the transmitter's own echo -----------------------------

void tm_receive() {
    Block::init();
    Dma<1>::init();
    // SINGLE-WIRE HALF DUPLEX IS THE WIRE THIS BOARD HAS NOT GOT: with
    // HDSEL the receiver listens on the transmit pad, so a block sent by
    // the transmit stream arrives back at the receive stream. The host
    // sees the block too - the pad is still the console's.
    const EngineRun r = run_engined<LoopSerial>(2, 128, 20);

    print(serial, "  sent ", r.queued, " byte(s) in ", r.millis, " ms and harvested ",
          r.harvested, " through the receive stream; ", r.hw_overruns, " overrun(s) in "
          "silicon, ", r.line_errors, " line error(s), ", r.rx_overruns,
          " ring(s) with no room, ", r.faults, " fault(s)", crlf);
    bench.verdict("the port comes up in half duplex with both slots filled", r.up);
    bench.verdict("the receive engine is armed from the first byte", r.rx_running);
    bench.verdict("the transmit stream drained the ring", r.drained);
    // WHAT IS NOT HARVESTED IS ACCOUNTED FOR - or it is THE RE-ARM GAP,
    // which is this engine's one real cost and is measured here rather
    // than assumed away. A receive run that fills stops the stream, and
    // the byte that arrives before harvest() has started the next run
    // can be lost - SILENTLY, with no overrun flag to show for it,
    // because nothing overran: the receiver was simply not being served.
    // Measured: one byte, exactly at the boundary where the first full
    // run is swapped for the next or a partial tail is read - WHERE it
    // falls depends on the harvest's timing against the line, so the
    // position is reported and the count is judged.
    const uint32_t accounted =
        static_cast<uint32_t>(r.harvested) + static_cast<uint32_t>(r.hw_overruns) +
        static_cast<uint32_t>(r.rx_overruns) + static_cast<uint32_t>(r.line_errors);
    print(serial, "  accounted for: ", accounted, " of ", r.queued, ", first gap at byte ",
          r.first_gap, crlf);
    bench.verdict("the echo arrives whole but for the re-arm gap",
                  r.harvested + 1u >= r.queued && r.harvested <= r.queued);
    print(serial, "  the gap, when there is one, is at a harvest: byte ", r.first_gap,
          " this time (", rx_ring_bytes, " is the first run's boundary)", crlf);
    bench.verdict("no block was thrown away", r.faults == 0u);
}

// ---- the menu -----------------------------------------------------------------------

void banner() {
    print(serial, crlf, "test_stm32f4_dma - the DMA controllers", crlf);
    bench.menu();
}

}   // namespace

// The console's own two streams are the only ones this suite ever arms an
// interrupt on: the engines do it in their arm(), and the vector is one
// stream's alone on this family.
namespace {
/// One body for both stream vectors: whichever engined transport owns
/// the port answers for its own streams, and nobody answers while the
/// plain interrupt-driven console has it.
[[gnu::always_inline]] inline void serve_engined() {
    if (engined_console == 1u) {
        (void)DmaSerial::dma_isr();
    } else if (engined_console == 2u) {
        (void)LoopSerial::dma_isr();
    }
}
}   // namespace

#if defined(STM32F446xx)
extern "C" void DMA1_Stream6_IRQHandler() { serve_engined(); }
extern "C" void DMA1_Stream5_IRQHandler() { serve_engined(); }
extern "C" void USART2_IRQHandler() {
    if (engined_console == 0u) {
        (void)Serial::isr();
    }
}
#elif defined(STM32F469xx)
extern "C" void DMA1_Stream3_IRQHandler() { serve_engined(); }
extern "C" void DMA1_Stream1_IRQHandler() { serve_engined(); }
extern "C" void USART3_IRQHandler() {
    if (engined_console == 0u) {
        (void)Serial::isr();
    }
}
#else
extern "C" void DMA2_Stream7_IRQHandler() { serve_engined(); }
extern "C" void DMA2_Stream2_IRQHandler() { serve_engined(); }
extern "C" void USART1_IRQHandler() {
    if (engined_console == 0u) {
        (void)Serial::isr();
    }
}
#endif

extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

