uliano/brio/stm32f4/src/apps/test_stm32f4_dma.cpp
int main() {
    // What the silicon held before a line of this program ran. The two
    // gates are read out of the RCC, so reading them does not open them;
    // a stream's own registers need the clock, so DMA2's is opened for
    // the reading and the reset values are what it finds.
    boot.gate1 = brio::Dma<1>::bus_clock();
    boot.gate2 = brio::Dma<2>::bus_clock();
    brio::Dma<1>::bus_clock(true);
    brio::Dma<2>::bus_clock(true);
    boot.lisr1 = brio::Dma<1>::low_flags();
    boot.hisr1 = brio::Dma<1>::high_flags();
    boot.lisr2 = brio::Dma<2>::low_flags();
    boot.hisr2 = brio::Dma<2>::high_flags();
    boot.cr = Work::control();
    boot.fcr = Work::fifo_control();
    boot.ndtr = Work::count();

    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    brio::enable_interrupts();

    bench.letter('a', "the two controllers and their sixteen vectors", ta_block);
    bench.letter('b', "a memory-to-memory block, byte-exact", tb_memory_to_memory);
    bench.letter('c', "what the driver refuses", tc_refusals);
    bench.letter('d', "the FIFO, table 49 cell by cell", td_fifo);
    bench.letter('e', "the throughput ladder", te_throughput);
    bench.letter('f', "the counting and alignment rules", tf_counting);
    bench.letter('g', "circular mode on the console's transmitter", tg_circular);
    bench.letter('h', "the double buffer", th_double_buffer);
    bench.letter('i', "the abort and the resume", ti_abort);
    bench.letter('j', "a transfer error", tj_transfer_error);
    bench.letter('k', "priority arbitration between two streams", tk_priority);
    bench.letter('l', "the console through the DMA engines", tl_engines);
    bench.letter('m', "the receive engine, on the transmitter's own echo", tm_receive);

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED", " tick=",
                    tick_ok ? "SysTick" : "FAILED", brio::crlf);
        banner();
        bench.prompt();
    }

    for (;;) {
        uint8_t c = 0;
        if (!Serial::read_byte(c)) {
            continue;
        }
        if (c == '\r' || c == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(c), brio::crlf);
        if (c == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(c))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
